window.DICTIONARY_DATA = [
  {
    "id": "asp",
    "term": "ASP (от англ. «Application Service Provider»)",
    "definition": "организация-провайдер, предоставляющая услуги по аренде программных продуктов и инфраструктуры на базе периодических платежей с доступом к приложениям через Интернет или виртуальную частную сеть",
    "letter": "А"
  },
  {
    "id": "абап",
    "term": "Абап (от англ. «ABAP», «Advanced Business Application Programming»)",
    "definition": "проприетарный внутренний язык программирования высокого уровня с синтаксисом, используемым в приложениях корпорации SAP",
    "letter": "А"
  },
  {
    "id": "абстрактная",
    "term": "Абстрактная функция (или «чистая виртуальная функция», от англ. «abstract function»)",
    "definition": "функция без определения, которую переопределяют дочерние классы",
    "letter": "А"
  },
  {
    "id": "ава",
    "term": "Ава (или «аватарка», от англ. «avatar»)",
    "definition": "графическое обозначение пользователя в Интернете (картинка / фото / изображение)",
    "letter": "А"
  },
  {
    "id": "автогад",
    "term": "Автогад",
    "definition": "система автоматизированного проектирования и черчения AutoCAD",
    "letter": "А"
  },
  {
    "id": "авторизация",
    "term": "Авторизация (от англ. «authorization»)",
    "definition": "процесс проверки прав при попытке выполнения действий",
    "letter": "А"
  },
  {
    "id": "адаптив",
    "term": "Адаптив (или «адаптивный дизайн», от англ. «adaptation»)",
    "definition": "процесс адаптации веб-страниц к отображению на экранах устройств с разными размерами",
    "letter": "А"
  },
  {
    "id": "аджайл",
    "term": "Аджайл (от англ. «Agile»)",
    "definition": "гибкая методология разработки, объединяющая подходы и практики на основе Манифеста гибкой разработки программного обеспечения",
    "letter": "А"
  },
  {
    "id": "админ",
    "term": "Админ (или «администратор», от англ. «admin»)",
    "definition": "специалист, занимающийся настройкой и поддержкой IT-инфраструктуры: железа, ПО и сетевых подключений",
    "letter": "А"
  },
  {
    "id": "адсл",
    "term": "АДСЛ (от англ. «ADSL»)",
    "definition": "технология высокоскоростной передачи данных через существующие телефонные линии",
    "letter": "А"
  },
  {
    "id": "айди",
    "term": "Айди (от англ. «id», «identificator»)",
    "definition": "уникальный признак объекта, позволяющий отличить его от других",
    "letter": "А"
  },
  {
    "id": "айпи",
    "term": "Айпи (или «IP-адрес», от англ. «Internet Protocol Address»)",
    "definition": "уникальный адрес устройства в сети, присваиваемый провайдером",
    "letter": "А"
  },
  {
    "id": "айти",
    "term": "Айти (или «IT», «информационные технологии»)",
    "definition": "отрасль, отвечающая за обработку, хранение и передачу информации с помощью технических устройств",
    "letter": "А"
  },
  {
    "id": "айти2",
    "term": "Айти-евангелист (от англ. «Technology evangelist»)",
    "definition": "человек, профессионально занимающийся продвижением IT-продуктов и формированием вокруг них аудитории",
    "letter": "А"
  },
  {
    "id": "айтишник",
    "term": "Айтишник",
    "definition": "специалист в сфере информационных технологий; чаще всего так называют программистов и людей, связанных с компьютерами",
    "letter": "А"
  },
  {
    "id": "ака",
    "term": "Ака (от англ. «a.k.a», «also known as»)",
    "definition": "«также известен как», «другими словами»",
    "letter": "А"
  },
  {
    "id": "аккаунт",
    "term": "Аккаунт (от англ. «account»)",
    "definition": "учётная запись пользователя, совокупность данных для аутентификации на ресурсе",
    "letter": "А"
  },
  {
    "id": "акцесс",
    "term": "Акцесс (от англ. «access»)",
    "definition": "1) уровень доступа пользователя; 2) СУБД Microsoft Access из пакета Microsoft Office",
    "letter": "А"
  },
  {
    "id": "алгоритм",
    "term": "Алгоритм",
    "definition": "строго определённый порядок действий, предназначенный для решения конкретной задачи",
    "letter": "А"
  },
  {
    "id": "альфа",
    "term": "Альфа",
    "definition": "внутренний, непубличный этап разработки ПО, во время которого тестировщики проверяют новый функционал",
    "letter": "А"
  },
  {
    "id": "альяс",
    "term": "Альяс (или «алиас»)",
    "definition": "псевдоним, короткое имя вместо длинного и сложного",
    "letter": "А"
  },
  {
    "id": "анлим",
    "term": "Анлим (от англ. «unlimited»)",
    "definition": "неограниченный доступ к чему-либо",
    "letter": "А"
  },
  {
    "id": "аноним",
    "term": "Аноним (от англ. «anonymous»)",
    "definition": "человек, скрывающий свою личность",
    "letter": "А"
  },
  {
    "id": "анпаблишед",
    "term": "Анпаблишед (от англ. «unpublished»)",
    "definition": "неопубликованный или неизданный",
    "letter": "А"
  },
  {
    "id": "анрег",
    "term": "Анрег",
    "definition": "незарегистрированный пользователь, ранее не проходивший аутентификацию",
    "letter": "А"
  },
  {
    "id": "апгрейд",
    "term": "Апгрейд (от англ. «upgrade»)",
    "definition": "усовершенствование и модернизация железа, ПО или оборудования",
    "letter": "А"
  },
  {
    "id": "апдейт",
    "term": "Апдейт (от англ. «update»)",
    "definition": "обновление программного обеспечения",
    "letter": "А"
  },
  {
    "id": "апи",
    "term": "Апи (от англ. «API», «Application Programming Interface»)",
    "definition": "интерфейс взаимодействия компьютерных программ между собой",
    "letter": "А"
  },
  {
    "id": "апликуха",
    "term": "Апликуха (от англ. «application»)",
    "definition": "прикладное программное обеспечение или мобильное приложение",
    "letter": "А"
  },
  {
    "id": "аплинк",
    "term": "Аплинк (от англ. «uplink»)",
    "definition": "вышестоящий линк, с которого узел получает данные",
    "letter": "А"
  },
  {
    "id": "апрув",
    "term": "Апрув (от англ. «approve»)",
    "definition": "подтверждение и одобрение чего-либо после предварительной проверки",
    "letter": "А"
  },
  {
    "id": "архиватор",
    "term": "Архиватор",
    "definition": "программа для сжатия файлов в единый архив без потери качества (7-Zip, WinRAR и др.)",
    "letter": "А"
  },
  {
    "id": "ассемблер",
    "term": "Ассемблер",
    "definition": "транслятор, преобразующий код на языке Ассемблера в машинный язык",
    "letter": "А"
  },
  {
    "id": "аттач",
    "term": "Аттач (от англ. «attach»)",
    "definition": "файл, прикреплённый к электронному письму",
    "letter": "А"
  },
  {
    "id": "аутсорс",
    "term": "Аутсорс (от англ. «outsource»)",
    "definition": "передача части задач компании специалистам вне её штата",
    "letter": "А"
  },
  {
    "id": "bcp",
    "term": "BCP (от англ. «Business Continuity Planning»)",
    "definition": "деятельность по снижению рисков прерывания бизнеса и восстановлению после сбоев",
    "letter": "Б"
  },
  {
    "id": "баг",
    "term": "Баг (от англ. «bug»)",
    "definition": "ошибка в коде, из-за которой программа ведёт себя неожиданно",
    "letter": "Б"
  },
  {
    "id": "баг2",
    "term": "Баг репорт (от англ. «bug report»)",
    "definition": "отчёт об ошибке с описанием, причиной появления и приоритетом",
    "letter": "Б"
  },
  {
    "id": "багоюзер",
    "term": "Багоюзер",
    "definition": "пользователь, намеренно использующий баги программ в своих интересах",
    "letter": "Б"
  },
  {
    "id": "база",
    "term": "База Данных (или «БД»)",
    "definition": "программный комплекс для хранения большого объёма структурированной информации",
    "letter": "Б"
  },
  {
    "id": "байт",
    "term": "Байт (от англ. «byte»)",
    "definition": "базовая единица хранения информации, состоящая из 8 битов",
    "letter": "Б"
  },
  {
    "id": "бан",
    "term": "Бан (от англ. «ban»)",
    "definition": "ограничение или полное лишение пользователя определённых прав на ресурсе",
    "letter": "Б"
  },
  {
    "id": "бандл",
    "term": "Бандл (от англ. «bundle»)",
    "definition": "маркетинговый приём объединения основного продукта с сопутствующими товарами",
    "letter": "Б"
  },
  {
    "id": "баннер",
    "term": "Баннер (от англ. «banner»)",
    "definition": "графическое или анимированное рекламное изображение на интернет-площадках",
    "letter": "Б"
  },
  {
    "id": "батник",
    "term": "Батник (от англ. «batch file»)",
    "definition": "текстовый файл с последовательностью команд для командного интерпретатора",
    "letter": "Б"
  },
  {
    "id": "батон",
    "term": "Батон (от англ. «button»)",
    "definition": "кнопка, элемент интерфейса приложения",
    "letter": "Б"
  },
  {
    "id": "ббс",
    "term": "ББС (от англ. «BBS», «bulletin board system»)",
    "definition": "электронная доска объявлений, способ взаимодействия пользователей через телефонные сети в эпоху веб 1.0",
    "letter": "Б"
  },
  {
    "id": "безголовый",
    "term": "Безголовый (от англ. «headless»)",
    "definition": "компьютер или система, работающие без монитора, управляемые через сеть",
    "letter": "Б"
  },
  {
    "id": "бенчмарк",
    "term": "Бенчмарк (от англ. «Benchmark»)",
    "definition": "эталонный тест производительности компьютерной системы",
    "letter": "Б"
  },
  {
    "id": "бета",
    "term": "Бета (от англ. «beta»)",
    "definition": "рабочая версия ПО, находящаяся на стадии публичного тестирования",
    "letter": "Б"
  },
  {
    "id": "бета2",
    "term": "Бета-тест (от англ. «beta-test»)",
    "definition": "финальное испытание продукта перед официальным выпуском",
    "letter": "Б"
  },
  {
    "id": "библиотека",
    "term": "Библиотека",
    "definition": "набор скомпилированного кода, упакованного для повторного использования в других программах",
    "letter": "Б"
  },
  {
    "id": "бигдата",
    "term": "Бигдата (от англ. «big data»)",
    "definition": "методы и инструменты хранения и обработки огромных объёмов данных",
    "letter": "Б"
  },
  {
    "id": "бит",
    "term": "Бит (от англ. «bit»)",
    "definition": "минимальная единица информации; принимает значение 0 или 1",
    "letter": "Б"
  },
  {
    "id": "биткоин",
    "term": "Биткоин (или «BTC»)",
    "definition": "пиринговая платёжная система и одноимённая криптовалюта, появившаяся в 2009 году",
    "letter": "Б"
  },
  {
    "id": "битый",
    "term": "Битый",
    "definition": "некорректный или нерабочий объект. «Битая ссылка» ведёт на несуществующую страницу (ошибка 404)",
    "letter": "Б"
  },
  {
    "id": "блог",
    "term": "Блог (от англ. «weblog»)",
    "definition": "дневник пользователя в сети с записями в текстовом, фото- или видеоформате",
    "letter": "Б"
  },
  {
    "id": "блок",
    "term": "Блок-схема",
    "definition": "графическая схема для описания алгоритмов, где шаги изображены блоками разной формы",
    "letter": "Б"
  },
  {
    "id": "блокчейн",
    "term": "Блокчейн (от англ. «blockchain»)",
    "definition": "непрерывная цепочка блоков с данными, хранящаяся на множестве независимых компьютеров",
    "letter": "Б"
  },
  {
    "id": "блохи",
    "term": "Блохи",
    "definition": "шуточное название небольших, незначительных багов в ПО",
    "letter": "Б"
  },
  {
    "id": "блютус",
    "term": "Блютус (от англ. «Bluetooth»)",
    "definition": "технология беспроводной передачи данных между устройствами на короткие расстояния",
    "letter": "Б"
  },
  {
    "id": "бот",
    "term": "Бот (от англ. «robot»)",
    "definition": "ПО для автоматизации рутинных задач, иногда с элементами искусственного интеллекта",
    "letter": "Б"
  },
  {
    "id": "ботнет",
    "term": "Ботнет",
    "definition": "сеть компьютеров с ботами, управляемая злоумышленником для выполнения вредоносных действий",
    "letter": "Б"
  },
  {
    "id": "браузер",
    "term": "Браузер (от англ. «browser»)",
    "definition": "программа для выхода в интернет и просмотра веб-страниц",
    "letter": "Б"
  },
  {
    "id": "брейншторм",
    "term": "Брейншторм (от англ. «brainstorm»)",
    "definition": "мозговой штурм, используется для генерации идей и поиска решений",
    "letter": "Б"
  },
  {
    "id": "бсод",
    "term": "БСОД (от англ. «BSoD», «blue screen of death»)",
    "definition": "«синий экран смерти», уведомление о критической ошибке в Windows",
    "letter": "Б"
  },
  {
    "id": "бутить",
    "term": "Бутить (или «ребутить»)",
    "definition": "перезагружать компьютер",
    "letter": "Б"
  },
  {
    "id": "буфер",
    "term": "Буфер данных",
    "definition": "часть памяти, зарезервированная под временное хранение данных при их перемещении",
    "letter": "Б"
  },
  {
    "id": "бэкап",
    "term": "Бэкап (от англ. «backup»)",
    "definition": "резервная копия данных для восстановления при сбоях",
    "letter": "Б"
  },
  {
    "id": "бэкенд",
    "term": "Бэкенд (от англ. «back-end»)",
    "definition": "серверная, программно-аппаратная часть приложения",
    "letter": "Б"
  },
  {
    "id": "бэклог",
    "term": "Бэклог (от англ. «backlog»)",
    "definition": "приоритизированный список задач для реализации в следующих версиях продукта",
    "letter": "Б"
  },
  {
    "id": "вай",
    "term": "Вай-Фай (от англ. «Wi-Fi»)",
    "definition": "технология беспроводных локальных сетей стандарта IEEE 802.11",
    "letter": "В"
  },
  {
    "id": "валидатор",
    "term": "Валидатор",
    "definition": "программа или ресурс, проверяющие корректность кода или данных",
    "letter": "В"
  },
  {
    "id": "валидация",
    "term": "Валидация (от англ. «validation»)",
    "definition": "проверка соответствия систем, процессов или данных заданным условиям",
    "letter": "В"
  },
  {
    "id": "валидный",
    "term": "Валидный (от англ. «valid»)",
    "definition": "допустимый, корректный, соответствующий установленным правилам",
    "letter": "В"
  },
  {
    "id": "варез",
    "term": "Варез (от англ. «warez»)",
    "definition": "ПО, незаконно распространяемое в интернете с нарушением авторских прав",
    "letter": "В"
  },
  {
    "id": "варнинг",
    "term": "Варнинг (от англ. «warning»)",
    "definition": "предупреждение в интерфейсе, не является ошибкой, но может повлиять на код",
    "letter": "В"
  },
  {
    "id": "вебинар",
    "term": "Вебинар (от англ. «web based seminar»)",
    "definition": "онлайн-выступление, лекция или презентация на выбранную тему",
    "letter": "В"
  },
  {
    "id": "видюха",
    "term": "Видюха",
    "definition": "видеокарта, устройство для обработки и вывода изображения на монитор",
    "letter": "В"
  },
  {
    "id": "визит",
    "term": "Визит",
    "definition": "каждое посещение пользователем веб-страницы",
    "letter": "В"
  },
  {
    "id": "вики",
    "term": "Вики (или «Википедия»)",
    "definition": "общедоступная многоязычная энциклопедия с открытым контентом",
    "letter": "В"
  },
  {
    "id": "вилдкарды",
    "term": "Вилдкарды (от англ. «wildcard characters»)",
    "definition": "символы-джокеры, используемые для замены других символов в шаблонах",
    "letter": "В"
  },
  {
    "id": "винда",
    "term": "Винда (от англ. «Windows»)",
    "definition": "операционная система Windows, созданная Microsoft в 1985 году",
    "letter": "В"
  },
  {
    "id": "винт",
    "term": "Винт (или «жёсткий диск», «винчестер»)",
    "definition": "накопитель на жёстких магнитных дисках для хранения данных",
    "letter": "В"
  },
  {
    "id": "вирус",
    "term": "Вирус",
    "definition": "вредоносное ПО, встраивающееся в код программ и распространяющееся по каналам связи",
    "letter": "В"
  },
  {
    "id": "виснуть",
    "term": "Виснуть",
    "definition": "состояние, когда компьютер или программа не реагирует на команды пользователя",
    "letter": "В"
  },
  {
    "id": "войтивайти",
    "term": "Войтивайти",
    "definition": "шуточный термин, обозначающий процесс перехода специалиста из другой сферы в IT",
    "letter": "В"
  },
  {
    "id": "ворд",
    "term": "Ворд",
    "definition": "текстовый редактор Microsoft Word для создания и форматирования текстовых документов",
    "letter": "В"
  },
  {
    "id": "воркшоп",
    "term": "Воркшоп (от англ. «workshop»)",
    "definition": "обучающее мероприятие, на котором участники совместно решают задачи",
    "letter": "В"
  },
  {
    "id": "выкатить",
    "term": "Выкатить",
    "definition": "вывести приложение или сайт в открытый доступ для всех пользователей",
    "letter": "В"
  },
  {
    "id": "выпадашка",
    "term": "Выпадашка",
    "definition": "элемент интерфейса типа «выпадающий список» (droplist)",
    "letter": "В"
  },
  {
    "id": "гаджет",
    "term": "Гаджет (от англ. «gadget»)",
    "definition": "небольшое электронное устройство, помогающее человеку в деятельности",
    "letter": "Г"
  },
  {
    "id": "гайд",
    "term": "Гайд (от англ. «guide»)",
    "definition": "инструкция или руководство по достижению определённой цели",
    "letter": "Г"
  },
  {
    "id": "геймдев",
    "term": "Геймдев (от англ. «game development»)",
    "definition": "процесс разработки игр под определённую платформу",
    "letter": "Г"
  },
  {
    "id": "геймер",
    "term": "Геймер (от англ. «gamer»)",
    "definition": "человек, проводящий время в компьютерных играх",
    "letter": "Г"
  },
  {
    "id": "геймплей",
    "term": "Геймплей (от англ. «gameplay»)",
    "definition": "игровой процесс, описывающий взаимодействие игрока с игровым миром",
    "letter": "Г"
  },
  {
    "id": "гейт",
    "term": "Гейт (от англ. «gate»)",
    "definition": "1) сетевой шлюз, устройство для сопряжения разнородных сетей; 2) плагин контроля уровня звукового сигнала",
    "letter": "Г"
  },
  {
    "id": "гектар",
    "term": "Гектар (или «гиг»)",
    "definition": "разговорное название гигабайта",
    "letter": "Г"
  },
  {
    "id": "генерить",
    "term": "Генерить (от англ. «generate»)",
    "definition": "сгенерировать, создать что-то новое",
    "letter": "Г"
  },
  {
    "id": "гестуры",
    "term": "Гестуры (от англ. «gestures»)",
    "definition": "движения пальца по экрану, заменяющие команды на мобильных устройствах",
    "letter": "Г"
  },
  {
    "id": "гик",
    "term": "Гик (от англ. «geek»)",
    "definition": "человек, глубоко разбирающийся в какой-либо области и являющийся фанатом своего дела",
    "letter": "Г"
  },
  {
    "id": "гит",
    "term": "Гит",
    "definition": "1) система контроля версий Git; 2) веб-сервис GitHub для хостинга IT-проектов",
    "letter": "Г"
  },
  {
    "id": "гитхаб",
    "term": "Гитхаб (от англ. «GitHub»)",
    "definition": "крупный веб-сервис для хранения репозиториев и совместной работы над проектами",
    "letter": "Г"
  },
  {
    "id": "гифка",
    "term": "Гифка",
    "definition": "анимированный графический файл в формате GIF",
    "letter": "Г"
  },
  {
    "id": "глобальные",
    "term": "Глобальные переменные",
    "definition": "переменные, объявленные вне блока; доступны в любом месте файла после объявления",
    "letter": "Г"
  },
  {
    "id": "глюк",
    "term": "Глюк",
    "definition": "случайная редкая ошибка в программе, вызванная некорректным кодом или сторонними программами",
    "letter": "Г"
  },
  {
    "id": "грызун",
    "term": "Грызун",
    "definition": "компьютерная мышь",
    "letter": "Г"
  },
  {
    "id": "гуглить",
    "term": "Гуглить",
    "definition": "искать информацию в поисковой системе",
    "letter": "Г"
  },
  {
    "id": "гуй",
    "term": "Гуй (или «GUI»)",
    "definition": "графический интерфейс пользователя, состоящий из окон, меню, кнопок и виджетов",
    "letter": "Г"
  },
  {
    "id": "гуру",
    "term": "Гуру",
    "definition": "опытный мастер и знаток в своей области; в IT так называют крутых программистов",
    "letter": "Г"
  },
  {
    "id": "даблклик",
    "term": "Даблклик (от англ. «double click»)",
    "definition": "двойное нажатие кнопкой мыши",
    "letter": "Д"
  },
  {
    "id": "дамп",
    "term": "Дамп (от англ. «dump»)",
    "definition": "файл с резервной копией системы или базы данных на момент его создания",
    "letter": "Д"
  },
  {
    "id": "дата",
    "term": "Дата центр (от англ. «data center»)",
    "definition": "специализированное здание для размещения и обслуживания серверного оборудования",
    "letter": "Д"
  },
  {
    "id": "даунлоад",
    "term": "Даунлоад (от англ. «download»)",
    "definition": "процесс скачивания файлов из одного устройства в другое",
    "letter": "Д"
  },
  {
    "id": "движок",
    "term": "Движок",
    "definition": "прикладная часть программного кода, реализующая определённую задачу",
    "letter": "Д"
  },
  {
    "id": "дебажить",
    "term": "Дебажить (от англ. «debug»)",
    "definition": "производить поиск ошибок в программе с последующим их исправлением",
    "letter": "Д"
  },
  {
    "id": "девайс",
    "term": "Девайс (от англ. «device»)",
    "definition": "любое техническое устройство с определённым функциональным назначением",
    "letter": "Д"
  },
  {
    "id": "девелопер",
    "term": "Девелопер (от англ. «developer»)",
    "definition": "специалист, занимающийся разработкой ПО и приложений",
    "letter": "Д"
  },
  {
    "id": "дедлайн",
    "term": "Дедлайн (от англ. «deadline»)",
    "definition": "крайний срок, к которому должна быть выполнена задача",
    "letter": "Д"
  },
  {
    "id": "декремент",
    "term": "Декремент (от англ. «decrement»)",
    "definition": "уменьшение значения переменной (обычно на единицу)",
    "letter": "Д"
  },
  {
    "id": "делфи",
    "term": "Делфи (от англ. «Delphi»)",
    "definition": "объектно-ориентированный язык программирования для создания прикладного ПО",
    "letter": "Д"
  },
  {
    "id": "демка",
    "term": "Демка (от англ. «demo»)",
    "definition": "демонстрационная версия продукта, зачастую с ограниченным функционалом",
    "letter": "Д"
  },
  {
    "id": "деплой",
    "term": "Деплой (от англ. «deploy»)",
    "definition": "развёртывание ПО на выбранном сервере или устройстве",
    "letter": "Д"
  },
  {
    "id": "десктоп",
    "term": "Десктоп (от англ. «desktop»)",
    "definition": "1) настольный компьютер; 2) рабочий стол операционной системы",
    "letter": "Д"
  },
  {
    "id": "деструктор",
    "term": "Деструктор (от англ. «destructor»)",
    "definition": "специальный метод класса, выполняющийся при удалении объекта",
    "letter": "Д"
  },
  {
    "id": "дефолтный",
    "term": "Дефолтный (от англ. «default»)",
    "definition": "значения, присваиваемые параметрам автоматически («по умолчанию»)",
    "letter": "Д"
  },
  {
    "id": "джава",
    "term": "Джава (от англ. «Java»)",
    "definition": "язык программирования для создания приложений под браузеры и мобильные устройства",
    "letter": "Д"
  },
  {
    "id": "джаваскрипт",
    "term": "Джаваскрипт (от англ. «JavaScript»)",
    "definition": "мультипарадигменный язык программирования для веб-разработки",
    "letter": "Д"
  },
  {
    "id": "джампер",
    "term": "Джампер (от англ. «jumper pins»)",
    "definition": "небольшой переключатель на плате, фиксирующий параметр на аппаратном уровне",
    "letter": "Д"
  },
  {
    "id": "джуниор",
    "term": "Джуниор (от англ. «Junior Developer»)",
    "definition": "младший разработчик с минимальным опытом работы",
    "letter": "Д"
  },
  {
    "id": "дидос",
    "term": "Дидос (от англ. «DDoS», «Distributed Denial of Service»)",
    "definition": "массированная атака на ресурс с целью сделать его недоступным",
    "letter": "Д"
  },
  {
    "id": "директория",
    "term": "Директория (или «папка»)",
    "definition": "каталог файловой системы, упрощающий хранение и организацию файлов",
    "letter": "Д"
  },
  {
    "id": "домен",
    "term": "Домен (от англ. «domain»)",
    "definition": "уникальный онлайн-адрес и имя сайта в интернете",
    "letter": "Д"
  },
  {
    "id": "дос",
    "term": "ДоС (от англ. «Denial of Service»)",
    "definition": "отказ сервера в обслуживании из-за множества поступающих запросов",
    "letter": "Д"
  },
  {
    "id": "драйвер",
    "term": "Драйвер (от англ. «driver»)",
    "definition": "ПО, обеспечивающее взаимодействие операционной системы с подключённым устройством",
    "letter": "Д"
  },
  {
    "id": "дроплист",
    "term": "Дроплист (от англ. «drop list»)",
    "definition": "выпадающий список, элемент графического интерфейса",
    "letter": "Д"
  },
  {
    "id": "дыра",
    "term": "Дыра",
    "definition": "уязвимость, позволяющая получить несанкционированный доступ к ПО или системе",
    "letter": "Д"
  },
  {
    "id": "еггогология",
    "term": "Еггогология",
    "definition": "изучение скрытых, недокументированных возможностей микрокалькуляторов",
    "letter": "Е"
  },
  {
    "id": "египетские",
    "term": "Египетские скобки",
    "definition": "стиль оформления кода, когда фигурные скобки ставятся в конце текущей строки",
    "letter": "Е"
  },
  {
    "id": "еррор",
    "term": "Еррор (от англ. «error»)",
    "definition": "ошибка, возникающая при выполнении недопустимых операций",
    "letter": "Е"
  },
  {
    "id": "железо",
    "term": "Железо",
    "definition": "материально-техническая часть и комплектующие компьютеров, ноутбуков и смартфонов",
    "letter": "Ж"
  },
  {
    "id": "железячник",
    "term": "Железячник",
    "definition": "человек, хорошо разбирающийся в компьютерном железе и следящий за новинками",
    "letter": "Ж"
  },
  {
    "id": "жж",
    "term": "ЖЖ",
    "definition": "живой журнал, онлайн-дневник на платформе Livejournal.com",
    "letter": "Ж"
  },
  {
    "id": "жипег",
    "term": "Жипег",
    "definition": "растровый графический формат JPEG для хранения фотографий и изображений",
    "letter": "Ж"
  },
  {
    "id": "зааджастить",
    "term": "Зааджастить (от англ. «to adjust»)",
    "definition": "немного изменить логику программы, подстроить под нужный результат",
    "letter": "З"
  },
  {
    "id": "заасайнить",
    "term": "Заасайнить таск (от англ. «to assign»)",
    "definition": "поручить задание специалисту в менеджере задач",
    "letter": "З"
  },
  {
    "id": "забанить",
    "term": "Забанить (от англ. «ban»)",
    "definition": "запретить пользователю доступ к ресурсу или возможность писать сообщения",
    "letter": "З"
  },
  {
    "id": "забэкапить",
    "term": "Забэкапить (от англ. «back up»)",
    "definition": "сделать резервную копию данных",
    "letter": "З"
  },
  {
    "id": "зависание",
    "term": "Зависание",
    "definition": "состояние, при котором программа или ОС перестаёт реагировать на команды пользователя",
    "letter": "З"
  },
  {
    "id": "заголовочные",
    "term": "Заголовочные файлы (от англ. «header files»)",
    "definition": "файлы, вставляемые компилятором в исходный текст программы",
    "letter": "З"
  },
  {
    "id": "зазиповать",
    "term": "Зазиповать",
    "definition": "упаковать файлы в архив формата .zip",
    "letter": "З"
  },
  {
    "id": "залить",
    "term": "Залить",
    "definition": "загрузить файлы на сервер или в базу данных",
    "letter": "З"
  },
  {
    "id": "залогиниться",
    "term": "Залогиниться",
    "definition": "войти в систему с использованием логина и пароля",
    "letter": "З"
  },
  {
    "id": "запилить",
    "term": "Запилить",
    "definition": "создать или добавить что-либо, реализовать новый функционал",
    "letter": "З"
  },
  {
    "id": "заплатка",
    "term": "Заплатка (или «патч»)",
    "definition": "дополнение, исправляющее ошибки в системе или ПО",
    "letter": "З"
  },
  {
    "id": "запостить",
    "term": "Запостить (от англ. «post»)",
    "definition": "создать и опубликовать пост в социальной сети или блоге",
    "letter": "З"
  },
  {
    "id": "засейвить",
    "term": "Засейвить (от англ. «save»)",
    "definition": "сохранить информацию или версию",
    "letter": "З"
  },
  {
    "id": "зафакапить",
    "term": "Зафакапить (от англ. «fuck up»)",
    "definition": "полностью провалить поставленную задачу",
    "letter": "З"
  },
  {
    "id": "зафейлить",
    "term": "Зафейлить (от англ. «fail»)",
    "definition": "не уложиться в срок или некачественно выполнить задачу",
    "letter": "З"
  },
  {
    "id": "звуковуха",
    "term": "Звуковуха",
    "definition": "звуковая плата компьютера для работы со звуком",
    "letter": "З"
  },
  {
    "id": "зловред",
    "term": "Зловред",
    "definition": "вредоносное ПО: вирус или шпионская программа",
    "letter": "З"
  },
  {
    "id": "змея",
    "term": "Змея (или «питон», от англ. «Python»)",
    "definition": "универсальный высокоуровневый язык программирования с минималистичным синтаксисом",
    "letter": "З"
  },
  {
    "id": "зомби",
    "term": "Зомби",
    "definition": "в IT: компьютеры, заражённые троянскими программами",
    "letter": "З"
  },
  {
    "id": "ибешник",
    "term": "Ибешник",
    "definition": "специалист отдела информационной безопасности",
    "letter": "И"
  },
  {
    "id": "игнор",
    "term": "Игнор (от англ. «ignore»)",
    "definition": "метка, при которой система скрывает сообщения выбранного пользователя",
    "letter": "И"
  },
  {
    "id": "идентификатор",
    "term": "Идентификатор (от англ. «identifier»)",
    "definition": "имя переменной, функции, класса или иного объекта в языке программирования",
    "letter": "И"
  },
  {
    "id": "иконка",
    "term": "Иконка (от англ. «icon»)",
    "definition": "маленькая картинка в графическом интерфейсе, обозначающая приложение или файл",
    "letter": "И"
  },
  {
    "id": "имба",
    "term": "Имба (от англ. «imbalanced»)",
    "definition": "несбалансированный элемент в компьютерной игре, дающий незаслуженное преимущество",
    "letter": "И"
  },
  {
    "id": "имплементация",
    "term": "Имплементация (от англ. «implementation»)",
    "definition": "практическая реализация методов в объектно-ориентированном программировании",
    "letter": "И"
  },
  {
    "id": "имхо",
    "term": "Имхо (от англ. «IMHO»)",
    "definition": "«по моему скромному мнению»",
    "letter": "И"
  },
  {
    "id": "индусский",
    "term": "Индусский код",
    "definition": "код, написанный избыточно длинно и запутанно",
    "letter": "И"
  },
  {
    "id": "инкапсуляция",
    "term": "Инкапсуляция (от англ. «encapsulation»)",
    "definition": "скрытие деталей реализации объекта и предоставление интерфейса для работы с ним",
    "letter": "И"
  },
  {
    "id": "инкремент",
    "term": "Инкремент (от англ. «increment»)",
    "definition": "увеличение значения переменной (обычно на единицу)",
    "letter": "И"
  },
  {
    "id": "инсталлировать",
    "term": "Инсталлировать (от англ. «install»)",
    "definition": "устанавливать программу или систему на компьютер",
    "letter": "И"
  },
  {
    "id": "интегрированная",
    "term": "Интегрированная среда разработки (от англ. «IDE»)",
    "definition": "комплекс ПО для разработки, компиляции и отладки кода",
    "letter": "И"
  },
  {
    "id": "интерпретатор",
    "term": "Интерпретатор (от англ. «Interpretation»)",
    "definition": "ПО, напрямую выполняющее код без предварительной компиляции",
    "letter": "И"
  },
  {
    "id": "интранет",
    "term": "Интранет",
    "definition": "внутренняя сеть организации на протоколе TCP/IP",
    "letter": "И"
  },
  {
    "id": "информационная",
    "term": "Информационная Безопасность (или «ИБ»)",
    "definition": "практика защиты информации от несанкционированного доступа и использования",
    "letter": "И"
  },
  {
    "id": "ип",
    "term": "ИП (или «IP»)",
    "definition": "уникальный адрес устройства или сайта в интернете",
    "letter": "И"
  },
  {
    "id": "ип2",
    "term": "ИП динамический",
    "definition": "временный IP-адрес, выдаваемый на время текущей сессии",
    "letter": "И"
  },
  {
    "id": "ип3",
    "term": "ИП статический",
    "definition": "постоянный IP-адрес, закреплённый за конкретным устройством",
    "letter": "И"
  },
  {
    "id": "искалка",
    "term": "Искалка",
    "definition": "поисковая система для удобного поиска информации",
    "letter": "И"
  },
  {
    "id": "исходник",
    "term": "Исходник",
    "definition": "файлы с исходным кодом приложения или первоначальный материал для создания чего-то нового",
    "letter": "И"
  },
  {
    "id": "итератор",
    "term": "Итератор (от англ. «iterator»)",
    "definition": "интерфейс для перебора элементов контейнера",
    "letter": "И"
  },
  {
    "id": "итерация",
    "term": "Итерация (от англ. «iteration»)",
    "definition": "повторение определённого действия или шага",
    "letter": "И"
  },
  {
    "id": "камень",
    "term": "Камень (или «процессор», «ЦП»)",
    "definition": "центральный процессор компьютера",
    "letter": "К"
  },
  {
    "id": "капсить",
    "term": "Капсить (от англ. «caps»)",
    "definition": "писать сообщения заглавными буквами; воспринимается как крик",
    "letter": "К"
  },
  {
    "id": "капча",
    "term": "Капча (от англ. «CAPTCHA»)",
    "definition": "тест для проверки, что пользователь является человеком, а не ботом",
    "letter": "К"
  },
  {
    "id": "касперыч",
    "term": "Касперыч",
    "definition": "антивирус Касперского, ПО для защиты от вирусов и вредоносных программ",
    "letter": "К"
  },
  {
    "id": "кастомер",
    "term": "Кастомер (от англ. «customer»)",
    "definition": "покупатель или клиент компании",
    "letter": "К"
  },
  {
    "id": "каталог",
    "term": "Каталог (или «папка», «директория»)",
    "definition": "объект файловой системы для упорядочивания файлов",
    "letter": "К"
  },
  {
    "id": "качалка",
    "term": "Качалка (от англ. «download manager»)",
    "definition": "менеджер загрузок, программа для скачивания файлов",
    "letter": "К"
  },
  {
    "id": "кейс",
    "term": "Кейс (от англ. «case»)",
    "definition": "реальная ситуация из практики с конкретными результатами",
    "letter": "К"
  },
  {
    "id": "киберсквоттинг",
    "term": "Киберсквоттинг (от англ. «cybersquatting»)",
    "definition": "регистрация привлекательных доменных имён для последующей перепродажи",
    "letter": "К"
  },
  {
    "id": "кило",
    "term": "Кило (или «килобайт»)",
    "definition": "единица измерения информации, равная 1024 байтам",
    "letter": "К"
  },
  {
    "id": "кирпич",
    "term": "Кирпич",
    "definition": "неработающее мобильное устройство; «окирпичивание» — намеренная или случайная поломка гаджета",
    "letter": "К"
  },
  {
    "id": "клава",
    "term": "Клава",
    "definition": "клавиатура",
    "letter": "К"
  },
  {
    "id": "клик",
    "term": "Клик (от англ. «click»)",
    "definition": "1) одиночное нажатие кнопки мыши; 2) переход на сайт по ссылке",
    "letter": "К"
  },
  {
    "id": "клон",
    "term": "Клон (от англ. «clone»)",
    "definition": "1) копия устройства известного бренда; 2) копия сайта, созданная для мошенничества",
    "letter": "К"
  },
  {
    "id": "кнопка",
    "term": "Кнопка",
    "definition": "элемент интерфейса, выполняющий определённое действие",
    "letter": "К"
  },
  {
    "id": "коворкинг",
    "term": "Коворкинг (от англ. «coworking»)",
    "definition": "арендованное пространство открытого типа для совместной работы специалистов",
    "letter": "К"
  },
  {
    "id": "кодер",
    "term": "Кодер (от англ. «coder»)",
    "definition": "программист, занимающийся написанием кода",
    "letter": "К"
  },
  {
    "id": "кодить",
    "term": "Кодить (от англ. «code»)",
    "definition": "заниматься программированием",
    "letter": "К"
  },
  {
    "id": "код",
    "term": "Код-ревью (от англ. «code review»)",
    "definition": "проверка разработанного кода для нахождения ошибок",
    "letter": "К"
  },
  {
    "id": "коммит",
    "term": "Коммит (от англ. «git commit»)",
    "definition": "запись изменений в репозиторий с комментарием и именем автора",
    "letter": "К"
  },
  {
    "id": "коммитить",
    "term": "Коммитить (от англ. «commit»)",
    "definition": "сохранять изменения кода в репозиторий",
    "letter": "К"
  },
  {
    "id": "компилятор",
    "term": "Компилятор (от англ. «compilating»)",
    "definition": "программа, переводящая код с языка программирования на машинный язык",
    "letter": "К"
  },
  {
    "id": "компиляция",
    "term": "Компиляция (от англ. «compilating»)",
    "definition": "перевод кода с высокоуровневого языка в исполняемую программу",
    "letter": "К"
  },
  {
    "id": "комьюнити",
    "term": "Комьюнити (от англ. «community»)",
    "definition": "сообщество пользователей или разработчиков, работающих с одним продуктом",
    "letter": "К"
  },
  {
    "id": "коннект",
    "term": "Коннект (от англ. «connect»)",
    "definition": "установленная связь между объектами или компьютерами",
    "letter": "К"
  },
  {
    "id": "константа",
    "term": "Константа (от англ. «constant»)",
    "definition": "переменная, значение которой нельзя изменить",
    "letter": "К"
  },
  {
    "id": "контент",
    "term": "Контент (от англ. «content»)",
    "definition": "содержательное наполнение сайта: тексты, изображения, аудио и видео",
    "letter": "К"
  },
  {
    "id": "конфа",
    "term": "Конфа (от англ. «conference»)",
    "definition": "1) конференция; 2) конфигурационный файл ПО",
    "letter": "К"
  },
  {
    "id": "конфиг",
    "term": "Конфиг",
    "definition": "конфигурационный файл с настройками системы и командами загрузки",
    "letter": "К"
  },
  {
    "id": "копипаст",
    "term": "Копипаст (от англ. «copy/paste»)",
    "definition": "операции «скопировать» и «вставить»; иронично — заимствование чужого контента",
    "letter": "К"
  },
  {
    "id": "костыль",
    "term": "Костыль",
    "definition": "наспех реализованное временное решение проблемы в готовом коде",
    "letter": "К"
  },
  {
    "id": "кракер",
    "term": "Кракер",
    "definition": "опытный программист, взламывающий систему защиты ПО",
    "letter": "К"
  },
  {
    "id": "кракозябры",
    "term": "Кракозябры",
    "definition": "бессмысленный набор символов из-за неправильной кодировки",
    "letter": "К"
  },
  {
    "id": "кресты",
    "term": "Кресты (или «C++»)",
    "definition": "язык программирования C++, широко используемый для разработки ПО, ОС и игр",
    "letter": "К"
  },
  {
    "id": "кроссплатформенный",
    "term": "Кроссплатформенный",
    "definition": "ПО, способное работать на нескольких платформах и ОС",
    "letter": "К"
  },
  {
    "id": "кряк",
    "term": "Кряк (от англ. «crack»)",
    "definition": "программа для взлома платного ПО с целью бесплатного использования",
    "letter": "К"
  },
  {
    "id": "куки",
    "term": "Куки (от англ. «cookies»)",
    "definition": "небольшой текстовый файл, который сайт сохраняет на устройство пользователя для его идентификации",
    "letter": "К"
  },
  {
    "id": "кулер",
    "term": "Кулер (от англ. «cooler»)",
    "definition": "система охлаждения из вентилятора и радиатора для защиты от перегрева",
    "letter": "К"
  },
  {
    "id": "кулхацкер",
    "term": "Кулхацкер (от англ. «cool hacker»)",
    "definition": "человек, считающий себя крутым хакером, но таковым не являющийся",
    "letter": "К"
  },
  {
    "id": "кэмэдэ",
    "term": "Кэмэдэ (от англ. «cmd», «командная строка»)",
    "definition": "текстовый интерфейс для ввода команд операционной системы",
    "letter": "К"
  },
  {
    "id": "лаг",
    "term": "Лаг (от англ. «lag»)",
    "definition": "торможение или медленная работа программы или игры",
    "letter": "Л"
  },
  {
    "id": "лайфхак",
    "term": "Лайфхак (от англ. «lifehack»)",
    "definition": "полезный совет, экономящий время при решении задачи",
    "letter": "Л"
  },
  {
    "id": "ламер",
    "term": "Ламер (от англ. «lamer»)",
    "definition": "неопытный пользователь, уверенный в своей компетентности",
    "letter": "Л"
  },
  {
    "id": "левел",
    "term": "Левел (от англ. «level»)",
    "definition": "уровень достижений или навыков",
    "letter": "Л"
  },
  {
    "id": "легаси",
    "term": "Легаси-код (от англ. «legacy code»)",
    "definition": "устаревший код, написанный давно и с которым теперь приходится работать",
    "letter": "Л"
  },
  {
    "id": "лечить",
    "term": "Лечить",
    "definition": "1) очищать компьютер от вирусов; 2) исправлять баги временным способом",
    "letter": "Л"
  },
  {
    "id": "либа",
    "term": "Либа (от англ. «Library»)",
    "definition": "библиотека кода",
    "letter": "Л"
  },
  {
    "id": "ликбез",
    "term": "Ликбез",
    "definition": "ликвидация безграмотности, обучение фундаментальным основам",
    "letter": "Л"
  },
  {
    "id": "линкануть",
    "term": "Линкануть (от англ. «link»)",
    "definition": "отправить ссылку на ресурс",
    "letter": "Л"
  },
  {
    "id": "линкинг",
    "term": "Линкинг (от англ. «linking»)",
    "definition": "связывание объектных файлов в единую программу",
    "letter": "Л"
  },
  {
    "id": "линк",
    "term": "Линк (от англ. «link»)",
    "definition": "гипертекстовая ссылка на сайт, документ или ресурс",
    "letter": "Л"
  },
  {
    "id": "линтер",
    "term": "Линтер",
    "definition": "программа, анализирующая код и предупреждающая об обнаруженных ошибках",
    "letter": "Л"
  },
  {
    "id": "линукс",
    "term": "Линукс (от англ. «Linux»)",
    "definition": "бесплатная ОС с открытым исходным кодом",
    "letter": "Л"
  },
  {
    "id": "лиса",
    "term": "Лиса (или «Firefox»)",
    "definition": "свободный браузер Mozilla Firefox с открытым исходным кодом",
    "letter": "Л"
  },
  {
    "id": "лицуха",
    "term": "Лицуха",
    "definition": "лицензия на использование ПО",
    "letter": "Л"
  },
  {
    "id": "личер",
    "term": "Личер (от англ. «leech»)",
    "definition": "пользователь файлообменника, скачивающий файлы без отдачи взамен",
    "letter": "Л"
  },
  {
    "id": "личка",
    "term": "Личка (или «личные сообщения»)",
    "definition": "приватная переписка двух пользователей, недоступная другим",
    "letter": "Л"
  },
  {
    "id": "логин",
    "term": "Логин (от англ. «login»)",
    "definition": "имя учётной записи для входа в систему",
    "letter": "Л"
  },
  {
    "id": "лого",
    "term": "Лого (от англ. «logo»)",
    "definition": "логотип, уникальный графический элемент для идентификации бренда",
    "letter": "Л"
  },
  {
    "id": "лог",
    "term": "Лог-файл (от англ. «log file»)",
    "definition": "файл с записями всех действий в ПО или на сервере",
    "letter": "Л"
  },
  {
    "id": "локализовать",
    "term": "Локализовать (от англ. «localization»)",
    "definition": "перевести ПО или ресурс на местный язык",
    "letter": "Л"
  },
  {
    "id": "локейшн",
    "term": "Локейшн (от англ. «location»)",
    "definition": "месторасположение, в IT — геолокация пользователя или путь к файлу",
    "letter": "Л"
  },
  {
    "id": "маздай",
    "term": "Маздай (от англ. «must die»)",
    "definition": "ироничное прозвище операционной системы Windows",
    "letter": "М"
  },
  {
    "id": "мазила",
    "term": "Мазила (от англ. «Mozilla»)",
    "definition": "браузер Mozilla Firefox",
    "letter": "М"
  },
  {
    "id": "майнинг",
    "term": "Майнинг (от англ. «mining»)",
    "definition": "добыча криптовалюты с помощью мощных компьютеров",
    "letter": "М"
  },
  {
    "id": "макрос",
    "term": "Макрос (от англ. «makros»)",
    "definition": "программный алгоритм для автоматизации рутинных действий",
    "letter": "М"
  },
  {
    "id": "малварь",
    "term": "Малварь (от англ. «malicious software»)",
    "definition": "вредоносное ПО, созданное для нанесения вреда",
    "letter": "М"
  },
  {
    "id": "манагер",
    "term": "Манагер (от англ. «manager»)",
    "definition": "менеджер или руководитель",
    "letter": "М"
  },
  {
    "id": "мануал",
    "term": "Мануал (от англ. «manual»)",
    "definition": "краткое руководство пользователя по работе с продуктом",
    "letter": "М"
  },
  {
    "id": "массив",
    "term": "Массив (от англ. «array»)",
    "definition": "совокупный тип данных для хранения переменных одного типа под единым идентификатором",
    "letter": "М"
  },
  {
    "id": "мейл",
    "term": "Мейл (от англ. «E-mail»)",
    "definition": "электронное письмо или почтовая служба",
    "letter": "М"
  },
  {
    "id": "мейнстрим",
    "term": "Мейнстрим (от англ. «mainstream»)",
    "definition": "направление, преобладающее в данный момент в какой-либо сфере",
    "letter": "М"
  },
  {
    "id": "ментор",
    "term": "Ментор (от англ. «mentor»)",
    "definition": "наставник, носитель ценных знаний и умений",
    "letter": "М"
  },
  {
    "id": "мешить",
    "term": "Мешить (от англ. «mention»)",
    "definition": "упомянуть другого пользователя в чате или социальной сети",
    "letter": "М"
  },
  {
    "id": "меню",
    "term": "Меню (от англ. «menu»)",
    "definition": "набор команд в приложении для выполнения необходимых операций",
    "letter": "М"
  },
  {
    "id": "мессага",
    "term": "Мессага (от англ. «message»)",
    "definition": "сообщение или письмо в интернет-пространстве",
    "letter": "М"
  },
  {
    "id": "мёржить",
    "term": "Мёржить (от англ. «Merge»)",
    "definition": "объединять несколько веток кода или таблиц данных",
    "letter": "М"
  },
  {
    "id": "мидл",
    "term": "Мидл (от англ. «Middle Developer»)",
    "definition": "средний уровень навыков программиста (между джуниором и сеньором)",
    "letter": "М"
  },
  {
    "id": "митап",
    "term": "Митап (от англ. «meetup»)",
    "definition": "встреча специалистов из одной сферы для обмена опытом",
    "letter": "М"
  },
  {
    "id": "митинг",
    "term": "Митинг (от англ. «meeting»)",
    "definition": "совещание для обсуждения итогов работы и постановки новых задач",
    "letter": "М"
  },
  {
    "id": "модем",
    "term": "Модем (от англ. «modem»)",
    "definition": "устройство для модуляции и демодуляции сигнала при передаче данных",
    "letter": "М"
  },
  {
    "id": "модератор",
    "term": "Модератор (от англ. «moderator»)",
    "definition": "пользователь ресурса, следящий за соблюдением правил",
    "letter": "М"
  },
  {
    "id": "моник",
    "term": "Моник (от англ. «monitor»)",
    "definition": "монитор, устройство вывода визуальной информации",
    "letter": "М"
  },
  {
    "id": "мониторить",
    "term": "Мониторить (от англ. «monitor»)",
    "definition": "отслеживать и собирать информацию из открытых источников",
    "letter": "М"
  },
  {
    "id": "мультикаст",
    "term": "Мультикаст (от англ. «multicast»)",
    "definition": "передача информации сразу группе получателей",
    "letter": "М"
  },
  {
    "id": "мыло",
    "term": "Мыло (от англ. «e-mail»)",
    "definition": "электронная почта",
    "letter": "М"
  },
  {
    "id": "мышкодром",
    "term": "Мышкодром",
    "definition": "коврик для мыши",
    "letter": "М"
  },
  {
    "id": "мэйлер",
    "term": "Мэйлер (от англ. «mailer»)",
    "definition": "программа для отправки и приёма почты",
    "letter": "М"
  },
  {
    "id": "навбар",
    "term": "Навбар (или «navbar»)",
    "definition": "блок с навигацией на сайте",
    "letter": "Н"
  },
  {
    "id": "накатить",
    "term": "Накатить",
    "definition": "внести изменения и развернуть новую версию приложения",
    "letter": "Н"
  },
  {
    "id": "нативный",
    "term": "Нативный (от англ. «native»)",
    "definition": "исходный код, написанный разработчиками без последующей модификации",
    "letter": "Н"
  },
  {
    "id": "нетворкинг",
    "term": "Нетворкинг (от англ. «networking»)",
    "definition": "профессиональное сообщество для обмена опытом и полезных знакомств",
    "letter": "Н"
  },
  {
    "id": "ник",
    "term": "Ник (или «никнейм», от англ. «nickname»)",
    "definition": "псевдоним пользователя в сети",
    "letter": "Н"
  },
  {
    "id": "нода",
    "term": "Нода (от англ. «node»)",
    "definition": "узел сети или блокчейна",
    "letter": "Н"
  },
  {
    "id": "нок",
    "term": "НОК (от англ. «NOC»)",
    "definition": "дата-центр, место для удалённого хранения и обработки данных",
    "letter": "Н"
  },
  {
    "id": "ноут",
    "term": "Ноут (от англ. «notebook»)",
    "definition": "ноутбук, переносной портативный компьютер",
    "letter": "Н"
  },
  {
    "id": "нуб",
    "term": "Нуб (от англ. «newbie»)",
    "definition": "неопытный новичок",
    "letter": "Н"
  },
  {
    "id": "область",
    "term": "Область видимости (от англ. «scope»)",
    "definition": "концепция, определяющая доступность переменной в коде",
    "letter": "О"
  },
  {
    "id": "обои",
    "term": "Обои (от англ. «wallpaper»)",
    "definition": "фоновый рисунок на рабочем столе",
    "letter": "О"
  },
  {
    "id": "оверклокинг",
    "term": "Оверклокинг (от англ. «overkloking»)",
    "definition": "разгон комплектующих компьютера для повышения производительности",
    "letter": "О"
  },
  {
    "id": "овертайм",
    "term": "Овертайм (от англ. «overtime»)",
    "definition": "сверхурочные часы работы сверх установленного рабочего дня",
    "letter": "О"
  },
  {
    "id": "окирпичить",
    "term": "Окирпичить",
    "definition": "испортить гаджет неудачной перепрошивкой",
    "letter": "О"
  },
  {
    "id": "ооп",
    "term": "ООП (или «Объектно-Ориентированное Программирование»)",
    "definition": "методология программирования, в которой программы представлены совокупностью объектов-экземпляров классов",
    "letter": "О"
  },
  {
    "id": "опенсорс",
    "term": "Опенсорс (от англ. «open source software»)",
    "definition": "ПО с открытым исходным кодом, который может использовать и изменять любой желающий",
    "letter": "О"
  },
  {
    "id": "опенспейс",
    "term": "Опенспейс (от англ. «open space»)",
    "definition": "рабочее пространство открытого типа без стен и перегородок",
    "letter": "О"
  },
  {
    "id": "оперативка",
    "term": "Оперативка (или «ОЗУ», «RAM»)",
    "definition": "оперативная память ПК с высокой скоростью чтения и записи",
    "letter": "О"
  },
  {
    "id": "оракл",
    "term": "Оракл (от англ. «Oracle»)",
    "definition": "объектно-реляционная СУБД Oracle Database",
    "letter": "О"
  },
  {
    "id": "ос",
    "term": "ОС (от англ. «Operating System»)",
    "definition": "операционная система, управляющая аппаратными ресурсами компьютера",
    "letter": "О"
  },
  {
    "id": "откатить",
    "term": "Откатить (от англ. «rollback»)",
    "definition": "вернуть предыдущую версию программы или приложения",
    "letter": "О"
  },
  {
    "id": "отладчик",
    "term": "Отладчик (от англ. «debugger»)",
    "definition": "ПО для автоматизированного поиска ошибок в коде",
    "letter": "О"
  },
  {
    "id": "офлайн",
    "term": "Офлайн (от англ. «offline»)",
    "definition": "нахождение пользователя вне сети",
    "letter": "О"
  },
  {
    "id": "офтопик",
    "term": "Офтопик (от англ. «off topic»)",
    "definition": "сообщение, не относящееся к теме обсуждения",
    "letter": "О"
  },
  {
    "id": "оффер",
    "term": "Оффер (от англ. «offer»)",
    "definition": "1) любое предложение; 2) оффер о работе с указанием должности и зарплаты",
    "letter": "О"
  },
  {
    "id": "падаван",
    "term": "Падаван",
    "definition": "шуточное название стажёра или джуниора в IT",
    "letter": "П"
  },
  {
    "id": "парсер",
    "term": "Парсер (от англ. «parser»)",
    "definition": "программа для сканирования, сбора и обработки данных из открытых источников",
    "letter": "П"
  },
  {
    "id": "парсить",
    "term": "Парсить (от англ. «parsing»)",
    "definition": "собирать и анализировать информацию из открытых источников",
    "letter": "П"
  },
  {
    "id": "паскаль",
    "term": "Паскаль (от англ. «Pascal»)",
    "definition": "один из известнейших процедурных языков программирования",
    "letter": "П"
  },
  {
    "id": "паттерн",
    "term": "Паттерн (от англ. «pattern»)",
    "definition": "1) эффективный способ решения типовых задач проектирования ПО; 2) бесшовный узор в графическом дизайне",
    "letter": "П"
  },
  {
    "id": "патч",
    "term": "Патч (от англ. «patch»)",
    "definition": "обновление продукта, исправляющее обнаруженные ошибки",
    "letter": "П"
  },
  {
    "id": "пень",
    "term": "Пень",
    "definition": "центральный процессор Intel Pentium",
    "letter": "П"
  },
  {
    "id": "переполнение",
    "term": "Переполнение (от англ. «overflow»)",
    "definition": "ситуация, когда весь доступный объём памяти занят",
    "letter": "П"
  },
  {
    "id": "периферия",
    "term": "Периферия (от англ. «peripherals»)",
    "definition": "все внешние устройства ввода и вывода, подключаемые к компьютеру",
    "letter": "П"
  },
  {
    "id": "песочница",
    "term": "Песочница (от англ. «sandbox»)",
    "definition": "изолированная среда, в которой программа может безопасно выполняться",
    "letter": "П"
  },
  {
    "id": "пет",
    "term": "Пет-проект (от англ. «pet-project»)",
    "definition": "личный проект, создаваемый для получения опыта или как хобби",
    "letter": "П"
  },
  {
    "id": "питон",
    "term": "Питон (от англ. «Python»)",
    "definition": "популярный высокоуровневый язык программирования с читаемым синтаксисом",
    "letter": "П"
  },
  {
    "id": "пинг",
    "term": "Пинг (от англ. «ping»)",
    "definition": "1) утилита проверки связи в сети; 2) время прохождения пакета данных до адресата и обратно",
    "letter": "П"
  },
  {
    "id": "пирант",
    "term": "Пирант",
    "definition": "человек, занимающийся незаконным распространением авторского контента",
    "letter": "П"
  },
  {
    "id": "подвал",
    "term": "Подвал (или «футер»)",
    "definition": "нижняя часть страницы сайта со служебной информацией",
    "letter": "П"
  },
  {
    "id": "подкаст",
    "term": "Подкаст (от англ. «podcast»)",
    "definition": "цикл аудио- или видеоуроков по определённой тематике",
    "letter": "П"
  },
  {
    "id": "попап",
    "term": "Попап (от англ. «pop-up»)",
    "definition": "всплывающее окно на сайте или в приложении",
    "letter": "П"
  },
  {
    "id": "пост",
    "term": "Пост (от англ. «post»)",
    "definition": "опубликованная запись в социальной сети, блоге или на форуме",
    "letter": "П"
  },
  {
    "id": "пофиксить",
    "term": "Пофиксить (от англ. «fix»)",
    "definition": "исправить ошибку или наладить работу",
    "letter": "П"
  },
  {
    "id": "превьюшка",
    "term": "Превьюшка (от англ. «Preview»)",
    "definition": "уменьшенное изображение для предварительного просмотра",
    "letter": "П"
  },
  {
    "id": "провайдер",
    "term": "Провайдер (от англ. «ISP»)",
    "definition": "компания, предоставляющая пользователям доступ в интернет",
    "letter": "П"
  },
  {
    "id": "прога",
    "term": "Прога (от англ. «program»)",
    "definition": "программа или утилита",
    "letter": "П"
  },
  {
    "id": "программер",
    "term": "Программер (от англ. «programmer»)",
    "definition": "программист, занимающийся разработкой ПО",
    "letter": "П"
  },
  {
    "id": "прод",
    "term": "Прод (от англ. «production environment»)",
    "definition": "сервер или среда с готовым рабочим приложением",
    "letter": "П"
  },
  {
    "id": "прокси",
    "term": "Прокси-сервер (от англ. «proxy»)",
    "definition": "посредник между пользователем и целевым сервером",
    "letter": "П"
  },
  {
    "id": "протокол",
    "term": "Протокол (от англ. «data transfer protocol»)",
    "definition": "стандарт обмена данными между устройствами",
    "letter": "П"
  },
  {
    "id": "профит",
    "term": "Профит (от англ. «profit»)",
    "definition": "положительный результат, прибыль или выгода",
    "letter": "П"
  },
  {
    "id": "прошивка",
    "term": "Прошивка",
    "definition": "ПО, встроенное в энергонезависимую память устройства и управляющее его работой",
    "letter": "П"
  },
  {
    "id": "прошить",
    "term": "Прошить",
    "definition": "изменить прошивку устройства",
    "letter": "П"
  },
  {
    "id": "пул",
    "term": "Пул реквест (от англ. «pull request»)",
    "definition": "запрос на слияние изменений в чужой репозиторий",
    "letter": "П"
  },
  {
    "id": "пушить",
    "term": "Пушить (от англ. «push»)",
    "definition": "публиковать или выгружать локальные изменения на сервер или в git",
    "letter": "П"
  },
  {
    "id": "разраб",
    "term": "Разраб (от англ. «developer»)",
    "definition": "разработчик",
    "letter": "Р"
  },
  {
    "id": "рандом",
    "term": "Рандом (от англ. «random»)",
    "definition": "случайная величина или случайный выбор",
    "letter": "Р"
  },
  {
    "id": "рарить",
    "term": "Рарить (от англ. «RAR»)",
    "definition": "архивировать файлы программой-архиватором RAR",
    "letter": "Р"
  },
  {
    "id": "расшарить",
    "term": "Расшарить (от англ. «share»)",
    "definition": "сделать файл или папку доступными для других пользователей",
    "letter": "Р"
  },
  {
    "id": "реалтайм",
    "term": "Реалтайм (от англ. «Real-Time»)",
    "definition": "режим обработки данных в реальном времени без задержки",
    "letter": "Р"
  },
  {
    "id": "ребутнуть",
    "term": "Ребутнуть (от англ. «reboot»)",
    "definition": "перезагрузить устройство или систему",
    "letter": "Р"
  },
  {
    "id": "ревью",
    "term": "Ревью (от англ. «review»)",
    "definition": "проверка кода с целью обнаружения и исправления ошибок",
    "letter": "Р"
  },
  {
    "id": "редизайн",
    "term": "Редизайн (от англ. «redesign»)",
    "definition": "обновление визуальной или функциональной части продукта",
    "letter": "Р"
  },
  {
    "id": "редирект",
    "term": "Редирект (от англ. «redirect»)",
    "definition": "автоматическое перенаправление пользователя на другой адрес",
    "letter": "Р"
  },
  {
    "id": "рекурсия",
    "term": "Рекурсия (от англ. «recursion»)",
    "definition": "определение объекта или процесса через самого себя",
    "letter": "Р"
  },
  {
    "id": "релиз",
    "term": "Релиз (от англ. «release»)",
    "definition": "выпуск готовой стабильной версии продукта в открытый доступ",
    "letter": "Р"
  },
  {
    "id": "рендер",
    "term": "Рендер (от англ. «render»)",
    "definition": "изображение, сгенерированное в 3D-редакторе",
    "letter": "Р"
  },
  {
    "id": "рендеринг",
    "term": "Рендеринг (от англ. «rendering»)",
    "definition": "процесс создания финального изображения из исходных данных",
    "letter": "Р"
  },
  {
    "id": "репозиторий",
    "term": "Репозиторий (от англ. «repository»)",
    "definition": "хранилище исходных файлов проекта",
    "letter": "Р"
  },
  {
    "id": "рефакторинг",
    "term": "Рефакторинг кода (от англ. «refactoring»)",
    "definition": "корректировка кода для повышения его читаемости и поддерживаемости",
    "letter": "Р"
  },
  {
    "id": "референс",
    "term": "Референс (от англ. «reference»)",
    "definition": "пример или образец, дающий представление о желаемом результате",
    "letter": "Р"
  },
  {
    "id": "ридми",
    "term": "Ридми (от англ. «read me»)",
    "definition": "файл с инструкцией и документацией к программе",
    "letter": "Р"
  },
  {
    "id": "роутинг",
    "term": "Роутинг (от англ. «routing»)",
    "definition": "процесс определения маршрута данных в сетях связи",
    "letter": "Р"
  },
  {
    "id": "руби",
    "term": "Руби (от англ. «Ruby»)",
    "definition": "интерпретируемый язык программирования для веб-приложений",
    "letter": "Р"
  },
  {
    "id": "рунет",
    "term": "Рунет",
    "definition": "русскоязычный сегмент интернета",
    "letter": "Р"
  },
  {
    "id": "рут",
    "term": "Рут (от англ. «root»)",
    "definition": "1) учётная запись администратора; 2) полный доступ к системе; 3) корневая директория",
    "letter": "Р"
  },
  {
    "id": "саббатикал",
    "term": "Саббатикал (от англ. «sabbaticals»)",
    "definition": "временный перерыв в карьере для отдыха и предотвращения выгорания",
    "letter": "С"
  },
  {
    "id": "сабж",
    "term": "Сабж (от англ. «subject»)",
    "definition": "тема электронного сообщения или предмет обсуждения",
    "letter": "С"
  },
  {
    "id": "саппорт",
    "term": "Саппорт (от англ. «support»)",
    "definition": "служба технической поддержки",
    "letter": "С"
  },
  {
    "id": "свайп",
    "term": "Свайп (от англ. «slide»)",
    "definition": "«смахивающее» движение пальца по сенсорному дисплею",
    "letter": "С"
  },
  {
    "id": "свитчер",
    "term": "Свитчер (от англ. «switcher»)",
    "definition": "человек, пришедший в IT из другой профессии",
    "letter": "С"
  },
  {
    "id": "сейвить",
    "term": "Сейвить (от англ. «save»)",
    "definition": "сохранять изменения или информацию",
    "letter": "С"
  },
  {
    "id": "секьюрный",
    "term": "Секьюрный (от англ. «security»)",
    "definition": "безопасный, надёжный, защищённый",
    "letter": "С"
  },
  {
    "id": "семантическая",
    "term": "Семантическая ошибка (от англ. «semantic error»)",
    "definition": "ошибка неправильной логики при синтаксически верном коде",
    "letter": "С"
  },
  {
    "id": "сеньор",
    "term": "Сеньор (от англ. «Senior Developer»)",
    "definition": "высший уровень квалификации разработчика",
    "letter": "С"
  },
  {
    "id": "сервак",
    "term": "Сервак (или «сервер», от англ. «server»)",
    "definition": "мощный компьютер для хранения данных и обеспечения к ним доступа",
    "letter": "С"
  },
  {
    "id": "сессия",
    "term": "Сессия (от англ. «session»)",
    "definition": "период от входа в систему до выхода из неё",
    "letter": "С"
  },
  {
    "id": "сетевуха",
    "term": "Сетевуха",
    "definition": "сетевая карта, устройство для подключения компьютера к сети",
    "letter": "С"
  },
  {
    "id": "сеть",
    "term": "Сеть",
    "definition": "1) (с большой буквы) интернет; 2) (с маленькой) связанные между собой компьютеры",
    "letter": "С"
  },
  {
    "id": "си",
    "term": "Си (или «язык C»)",
    "definition": "компилируемый статически типизированный язык программирования, ставший основой для C++, Java и других",
    "letter": "С"
  },
  {
    "id": "сиквел",
    "term": "Сиквел (или «SQL»)",
    "definition": "язык структурированных запросов к базам данных",
    "letter": "С"
  },
  {
    "id": "сисадмин",
    "term": "Сисадмин (от англ. «System Administrator»)",
    "definition": "специалист, обеспечивающий работу компьютерной техники и сети компании",
    "letter": "С"
  },
  {
    "id": "система",
    "term": "Система (от англ. «system»)",
    "definition": "1) операционная система; 2) комплекс железа и ПО в одной установке",
    "letter": "С"
  },
  {
    "id": "скилл",
    "term": "Скилл (от англ. «skill»)",
    "definition": "навыки, умения и мастерство в определённой сфере",
    "letter": "С"
  },
  {
    "id": "скипнуть",
    "term": "Скипнуть (от англ. «skip»)",
    "definition": "пропустить или проигнорировать что-либо",
    "letter": "С"
  },
  {
    "id": "скрипт",
    "term": "Скрипт (от англ. «script»)",
    "definition": "программный файл, автоматизирующий определённую задачу",
    "letter": "С"
  },
  {
    "id": "скроллинг",
    "term": "Скроллинг (от англ. «scrolling»)",
    "definition": "прокрутка страницы для просмотра длинного блока информации",
    "letter": "С"
  },
  {
    "id": "скрам",
    "term": "Скрам (от англ. «scrum»)",
    "definition": "метод управления проектами из методологии Agile",
    "letter": "С"
  },
  {
    "id": "скрин",
    "term": "Скрин (от англ. «screenshot»)",
    "definition": "снимок экрана компьютера или смартфона",
    "letter": "С"
  },
  {
    "id": "сниппет",
    "term": "Сниппет (от англ. «snippet»)",
    "definition": "небольшой фрагмент кода, пригодный для повторного использования",
    "letter": "С"
  },
  {
    "id": "сносить",
    "term": "Сносить",
    "definition": "удалять, деинсталлировать ПО",
    "letter": "С"
  },
  {
    "id": "собес",
    "term": "Собес",
    "definition": "собеседование при приёме на работу",
    "letter": "С"
  },
  {
    "id": "софт",
    "term": "Софт (от англ. «software»)",
    "definition": "программное обеспечение",
    "letter": "С"
  },
  {
    "id": "мягкие",
    "term": "Мягкие навыки (от англ. «soft skills»)",
    "definition": "социальные, коммуникативные и личностные качества человека",
    "letter": "С"
  },
  {
    "id": "спам",
    "term": "Спам (от англ. «spam»)",
    "definition": "нежелательные рекламные письма и сообщения",
    "letter": "С"
  },
  {
    "id": "спринт",
    "term": "Спринт (от англ. «sprint»)",
    "definition": "временной отрезок в Scrum (1–4 недели), за который команда выполняет задачи",
    "letter": "С"
  },
  {
    "id": "стек",
    "term": "Стек (от англ. «Stack»)",
    "definition": "1) абстрактный тип данных; 2) список технологий, используемых разработчиком",
    "letter": "С"
  },
  {
    "id": "стрим",
    "term": "Стрим (от англ. «stream»)",
    "definition": "онлайн-трансляция событий или действий в реальном времени",
    "letter": "С"
  },
  {
    "id": "субдомен",
    "term": "Субдомен (от англ. «subdomain»)",
    "definition": "часть домена или отдельный сайт в составе основного доменного имени",
    "letter": "С"
  },
  {
    "id": "таглайн",
    "term": "Таглайн (от англ. «TagLine»)",
    "definition": "необязательная строка в конце письма с цитатой или шуткой",
    "letter": "Т"
  },
  {
    "id": "тап",
    "term": "Тап (от англ. «tap»)",
    "definition": "короткое нажатие на элемент интерфейса сенсорного устройства",
    "letter": "Т"
  },
  {
    "id": "таска",
    "term": "Таска (от англ. «task»)",
    "definition": "задание или поручение",
    "letter": "Т"
  },
  {
    "id": "тачпэд",
    "term": "Тачпэд (от англ. «touch pad»)",
    "definition": "сенсорная панель на ноутбуке для управления курсором",
    "letter": "Т"
  },
  {
    "id": "тачскрин",
    "term": "Тачскрин (от англ. «touch screen»)",
    "definition": "сенсорный экран, реагирующий на прикосновения пальца",
    "letter": "Т"
  },
  {
    "id": "твинк",
    "term": "Твинк (от англ. «Read-only-user»)",
    "definition": "аккаунт с правом только на чтение документа без возможности редактирования",
    "letter": "Т"
  },
  {
    "id": "темплейт",
    "term": "Темплейт (от англ. «template»)",
    "definition": "шаблон или заготовка для документа",
    "letter": "Т"
  },
  {
    "id": "тест",
    "term": "Тест (от англ. «test»)",
    "definition": "данные для тестирования продукта или система тестирования",
    "letter": "Т"
  },
  {
    "id": "тестировщик",
    "term": "Тестировщик (от англ. «tester»)",
    "definition": "специалист по тестированию ПО",
    "letter": "Т"
  },
  {
    "id": "технарь",
    "term": "Технарь",
    "definition": "специалист с техническим образованием; в IT — бэкенд-разработчик",
    "letter": "Т"
  },
  {
    "id": "тимлид",
    "term": "Тимлид (от англ. «team leader»)",
    "definition": "руководитель команды разработчиков",
    "letter": "Т"
  },
  {
    "id": "торрент",
    "term": "Торрент (или «BitTorrent»)",
    "definition": "технология передачи файлов от пользователя к пользователю без сервера",
    "letter": "Т"
  },
  {
    "id": "точка",
    "term": "Точка останова (от англ. «breakpoint»)",
    "definition": "маркер в коде, на котором прерывается выполнение программы для отладки",
    "letter": "Т"
  },
  {
    "id": "трабл",
    "term": "Трабл (от англ. «trouble»)",
    "definition": "проблема, неприятность",
    "letter": "Т"
  },
  {
    "id": "трафик",
    "term": "Трафик (от англ. «traffic»)",
    "definition": "1) объём данных в интернете; 2) количество скачанных данных",
    "letter": "Т"
  },
  {
    "id": "трейни",
    "term": "Трейни (от англ. «trainee»)",
    "definition": "стажёр, не дотягивающий по знаниям до уровня Junior",
    "letter": "Т"
  },
  {
    "id": "тролль",
    "term": "Тролль",
    "definition": "человек, намеренно провоцирующий конфликты в интернете",
    "letter": "Т"
  },
  {
    "id": "троян",
    "term": "Троян",
    "definition": "вредоносная программа, проникающая в компьютер под видом легитимного ПО",
    "letter": "Т"
  },
  {
    "id": "тултип",
    "term": "Тултип (от англ. «tooltip»)",
    "definition": "подсказка, появляющаяся при наведении курсора на элемент интерфейса",
    "letter": "Т"
  },
  {
    "id": "туториал",
    "term": "Туториал (от англ. «tutorial»)",
    "definition": "подробные обучающие уроки на определённую тему",
    "letter": "Т"
  },
  {
    "id": "тз",
    "term": "ТЗ (или «техзадание»)",
    "definition": "техническое задание с целями, задачами и требованиями к проекту",
    "letter": "Т"
  },
  {
    "id": "убить",
    "term": "Убить",
    "definition": "удалить или стереть что-либо (приложение, версию, запись)",
    "letter": "У"
  },
  {
    "id": "указатель",
    "term": "Указатель (от англ. «pointer»)",
    "definition": "переменная, хранящая адрес ячейки памяти",
    "letter": "У"
  },
  {
    "id": "урл",
    "term": "Урл (от англ. «URL»)",
    "definition": "адрес страницы или ресурса в интернете",
    "letter": "У"
  },
  {
    "id": "установочник",
    "term": "Установочник (от англ. «set up»)",
    "definition": "программа-инсталлятор, устанавливающая ПО на компьютер",
    "letter": "У"
  },
  {
    "id": "утилита",
    "term": "Утилита (от англ. «utility»)",
    "definition": "вспомогательное ПО для настройки системы или выполнения служебных задач",
    "letter": "У"
  },
  {
    "id": "фаервол",
    "term": "Фаервол (от англ. «firewall»)",
    "definition": "программа или устройство для защиты компьютера от несанкционированного доступа из сети",
    "letter": "Ф"
  },
  {
    "id": "факап",
    "term": "Факап (от англ. «fuck up»)",
    "definition": "крупная неудача или провал",
    "letter": "Ф"
  },
  {
    "id": "фак",
    "term": "Фак (от англ. «FAQ»)",
    "definition": "блок ответов на часто задаваемые вопросы",
    "letter": "Ф"
  },
  {
    "id": "фаундер",
    "term": "Фаундер (от англ. «founder»)",
    "definition": "основатель или создатель компании или проекта",
    "letter": "Ф"
  },
  {
    "id": "фидбек",
    "term": "Фидбек (от англ. «feedback»)",
    "definition": "обратная связь, отзыв или рецензия о чём-либо",
    "letter": "Ф"
  },
  {
    "id": "фича",
    "term": "Фича (от англ. «feature»)",
    "definition": "уникальная особенность или функция продукта",
    "letter": "Ф"
  },
  {
    "id": "флейм",
    "term": "Флейм (от англ. «flame»)",
    "definition": "«спор ради спора», агрессивная дискуссия с переходом на личности",
    "letter": "Ф"
  },
  {
    "id": "флуд",
    "term": "Флуд (от англ. «flood»)",
    "definition": "засорение чатов или каналов несвязанной с темой информацией",
    "letter": "Ф"
  },
  {
    "id": "флэшка",
    "term": "Флэшка (от англ. «flash drive»)",
    "definition": "компактное USB-запоминающее устройство",
    "letter": "Ф"
  },
  {
    "id": "форвард",
    "term": "Форвард (от англ. «forward»)",
    "definition": "пересылка полученного письма другому пользователю",
    "letter": "Ф"
  },
  {
    "id": "форум",
    "term": "Форум (от англ. «Forum»)",
    "definition": "сайт или раздел для организации общения пользователей",
    "letter": "Ф"
  },
  {
    "id": "фотошоп",
    "term": "Фотошоп (от англ. «Photoshop»)",
    "definition": "1) графический редактор Adobe Photoshop; 2) любое обработанное изображение",
    "letter": "Ф"
  },
  {
    "id": "фреймворк",
    "term": "Фреймворк (от англ. «framework»)",
    "definition": "платформа, облегчающая создание и поддержку компонентов проекта",
    "letter": "Ф"
  },
  {
    "id": "фривар",
    "term": "Фривар (от англ. «freeware»)",
    "definition": "бесплатное ПО, находящееся в свободном доступе",
    "letter": "Ф"
  },
  {
    "id": "фрилансер",
    "term": "Фрилансер (от англ. «freelancer»)",
    "definition": "человек, работающий на дому без постоянного трудоустройства",
    "letter": "Ф"
  },
  {
    "id": "фронтенд",
    "term": "Фронтенд (от англ. «front-end»)",
    "definition": "клиентская часть веб-сайта или приложения, которую видит пользователь",
    "letter": "Ф"
  },
  {
    "id": "фронтендер",
    "term": "Фронтендер (от англ. «front-end»)",
    "definition": "разработчик клиентской части программного продукта",
    "letter": "Ф"
  },
  {
    "id": "фуллстек",
    "term": "Фуллстек-разработчик (от англ. «full stack»)",
    "definition": "разработчик, работающий как в бэкенде, так и в фронтенде",
    "letter": "Ф"
  },
  {
    "id": "функция",
    "term": "Функция (от англ. «function»)",
    "definition": "блок кода для реализации определённой задачи",
    "letter": "Ф"
  },
  {
    "id": "хак",
    "term": "Хак (от англ. «hack»)",
    "definition": "1) изящное программистское решение; 2) взлом защиты; 3) обход проблемы",
    "letter": "Х"
  },
  {
    "id": "хакатон",
    "term": "Хакатон (от англ. «hack marathon»)",
    "definition": "мероприятие, где специалисты совместно работают над проектом",
    "letter": "Х"
  },
  {
    "id": "хакер",
    "term": "Хакер (от англ. «hacker»)",
    "definition": "1) знаток компьютеров с исследовательским интересом; 2) кибер-преступник",
    "letter": "Х"
  },
  {
    "id": "хард",
    "term": "Хард (от англ. «hard disk»)",
    "definition": "жёсткий диск или аппаратное обеспечение компьютера",
    "letter": "Х"
  },
  {
    "id": "хард2",
    "term": "Хард скиллы (от англ. «hard skills»)",
    "definition": "глубокие технические знания, умения и опыт",
    "letter": "Х"
  },
  {
    "id": "хостинг",
    "term": "Хостинг",
    "definition": "услуга по размещению сайта или данных на сервере провайдера",
    "letter": "Х"
  },
  {
    "id": "хоткей",
    "term": "Хоткей (от англ. «hotkey»)",
    "definition": "горячая клавиша для быстрого доступа к команде",
    "letter": "Х"
  },
  {
    "id": "хотфикс",
    "term": "Хотфикс (от англ. «hot fix»)",
    "definition": "срочное исправление критических ошибок с минимальными сроками",
    "letter": "Х"
  },
  {
    "id": "хэдер",
    "term": "Хэдер (от англ. «header»)",
    "definition": "верхняя часть веб-страницы с логотипом и меню",
    "letter": "Х"
  },
  {
    "id": "цикл",
    "term": "Цикл (от англ. «Cycle»)",
    "definition": "языковая конструкция, повторяющая инструкции до выполнения условия",
    "letter": "Ц"
  },
  {
    "id": "цод",
    "term": "ЦОД (от англ. «data center»)",
    "definition": "центр обработки данных, место размещения серверной инфраструктуры",
    "letter": "Ц"
  },
  {
    "id": "цп",
    "term": "ЦП (или «CPU», «процессор»)",
    "definition": "центральный процессор, обрабатывающий машинный код",
    "letter": "Ц"
  },
  {
    "id": "цэмэс",
    "term": "Цэмэс (от англ. «CMS»)",
    "definition": "система управления контентом сайта",
    "letter": "Ц"
  },
  {
    "id": "цээсэс",
    "term": "Цээсэс (от англ. «CSS»)",
    "definition": "язык описания внешнего вида HTML-документов",
    "letter": "Ц"
  },
  {
    "id": "чаво",
    "term": "ЧаВо (или «FAQ»)",
    "definition": "сокращение от «часто задаваемые вопросы», блок ответов для пользователей",
    "letter": "Ч"
  },
  {
    "id": "чайник",
    "term": "Чайник",
    "definition": "новичок, плохо разбирающийся в компьютерах",
    "letter": "Ч"
  },
  {
    "id": "чат",
    "term": "Чат (от англ. «chat»)",
    "definition": "способ общения в реальном времени посредством обмена текстовыми сообщениями",
    "letter": "Ч"
  },
  {
    "id": "чекать",
    "term": "Чекать (от англ. «check»)",
    "definition": "проверять что-либо или просматривать на предмет ошибок",
    "letter": "Ч"
  },
  {
    "id": "чекбокс",
    "term": "Чекбокс (от англ. «check box»)",
    "definition": "элемент интерфейса с двумя состояниями: включено и отключено",
    "letter": "Ч"
  },
  {
    "id": "челлендж",
    "term": "Челлендж (от англ. «challenge»)",
    "definition": "нестандартная задача, решение которой можно считать достижением",
    "letter": "Ч"
  },
  {
    "id": "червь",
    "term": "Червь (от англ. «worm»)",
    "definition": "вредоносное ПО, распространяющееся через компьютерные сети",
    "letter": "Ч"
  },
  {
    "id": "чпу",
    "term": "ЧПУ",
    "definition": "«человекопонятный URL»; адрес страницы из понятных символов, отражающих содержание",
    "letter": "Ч"
  },
  {
    "id": "шаблон",
    "term": "Шаблон (от англ. «pattern»)",
    "definition": "универсальная версия функции или класса, работающая с разными типами данных",
    "letter": "Ш"
  },
  {
    "id": "шара",
    "term": "Шара (от англ. «shared»)",
    "definition": "файлы, папки или диски, открытые для общего доступа в сети",
    "letter": "Ш"
  },
  {
    "id": "шарить",
    "term": "Шарить",
    "definition": "1) хорошо разбираться в чём-либо; 2) давать другим доступ к своим ресурсам",
    "letter": "Ш"
  },
  {
    "id": "шаровары",
    "term": "Шаровары (от англ. «shareware»)",
    "definition": "коммерческое условно-бесплатное ПО",
    "letter": "Ш"
  },
  {
    "id": "шарпы",
    "term": "Шарпы (или «C#»)",
    "definition": "объектно-ориентированный язык программирования Microsoft для ПК, веб и мобильных приложений",
    "letter": "Ш"
  },
  {
    "id": "шлаг",
    "term": "Шлаг (или «сетевой кабель»)",
    "definition": "кабель для интернет-соединения и передачи данных",
    "letter": "Ш"
  },
  {
    "id": "эксель",
    "term": "Эксель (от англ. «Excel»)",
    "definition": "программа Microsoft Excel для работы с электронными таблицами",
    "letter": "Э"
  },
  {
    "id": "эксплойт",
    "term": "Эксплойт (от англ. «exploit»)",
    "definition": "вредоносный код, атакующий систему через найденную уязвимость",
    "letter": "Э"
  },
  {
    "id": "электронная",
    "term": "Электронная почта (или «e-mail»)",
    "definition": "технология отправки и получения сообщений в электронном формате",
    "letter": "Э"
  },
  {
    "id": "эникейщик",
    "term": "Эникейщик (от англ. «any key»)",
    "definition": "IT-работник низкой квалификации, выполняющий шаблонные задачи",
    "letter": "Э"
  },
  {
    "id": "эпикфэйл",
    "term": "Эпикфэйл (от англ. «epic fail»)",
    "definition": "эпический провал, серьёзная неудача",
    "letter": "Э"
  },
  {
    "id": "юзабилити",
    "term": "Юзабилити (от англ. «usability»)",
    "definition": "показатель удобства работы пользователя с продуктом",
    "letter": "Ю"
  },
  {
    "id": "юзать",
    "term": "Юзать (от англ. «use»)",
    "definition": "использовать или пользоваться чем-либо",
    "letter": "Ю"
  },
  {
    "id": "юзер",
    "term": "Юзер (от англ. «user»)",
    "definition": "активный пользователь компьютера или сети",
    "letter": "Ю"
  },
  {
    "id": "юникс",
    "term": "Юникс (от англ. «Unix»)",
    "definition": "семейство гибких многозадачных операционных систем с модульным дизайном",
    "letter": "Ю"
  },
  {
    "id": "яблочник",
    "term": "Яблочник (от англ. «Apple»)",
    "definition": "активный пользователь или фанат устройств Apple",
    "letter": "Я"
  },
  {
    "id": "яндекс",
    "term": "Яндекс (от англ. «Yandex»)",
    "definition": "российская поисковая система и интернет-портал",
    "letter": "Я"
  },
  {
    "id": "яп",
    "term": "ЯП",
    "definition": "язык программирования, формальный язык для записи компьютерных программ",
    "letter": "Я"
  },
  {
    "id": "ярлык",
    "term": "Ярлык (от англ. «shortcut»)",
    "definition": "значок-ссылка на объект, размещаемый в удобном месте (обычно на рабочем столе)",
    "letter": "Я"
  }
];
